##  Find Total Time Spent by Each Employee Table Leetcode Task19

In [2]:
import pandas as pd
import numpy as np

In [12]:
data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
Employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

In [13]:
Employees

   emp_id  event_day  in_time  out_time
0       1 2020-11-28        4        32
1       1 2020-11-28       55       200
2       1 2020-12-03        1        42
3       2 2020-11-28        3        33
4       2 2020-12-09       47        74

In [14]:
Employees['total_time'] = Employees['out_time'] - Employees['in_time']
Employees

   emp_id  event_day  in_time  out_time  total_time
0       1 2020-11-28        4        32          28
1       1 2020-11-28       55       200         145
2       1 2020-12-03        1        42          41
3       2 2020-11-28        3        33          30
4       2 2020-12-09       47        74          27

In [15]:
Employees.drop(['out_time', 'in_time'], axis=1, inplace=True)
Employees

   emp_id  event_day  total_time
0       1 2020-11-28          28
1       1 2020-11-28         145
2       1 2020-12-03          41
3       2 2020-11-28          30
4       2 2020-12-09          27

In [23]:
Employees=Employees.groupby(['event_day','emp_id']).sum().reset_index()
Employees=Employees.sort_values('emp_id')
Employees

   event_day  emp_id  total_time
0 2020-11-28       1         173
2 2020-12-03       1          41
1 2020-11-28       2          30
3 2020-12-09       2          27